NTURacingTeam/nturt_stm32_front_box/Core/Src/sensors.c
            oil_filtered = exp_filter(oil_transfer_function(adc_dma_buffer.oil) , oil_filtered, ALPHA_OIL_PRESSURE);
            oil = oil_transfer_function(adc_dma_buffer.oil);

            /*error reporting for APPS and BSE ---------------------------------------------------------------*/
            //TODO: another error handler for implausibility
            Error_report(ERROR_CODE_APPS1_HIGH, &pedal_err_count.apps1.high, apps1 > 1.0 ? true : false);
            Error_report(ERROR_CODE_APPS1_LOW, &pedal_err_count.apps1.low, apps1 < 0.0 ? true : false);
            Error_report(ERROR_CODE_APPS2_HIGH, &pedal_err_count.apps2.high, apps2 > 1.0 ? true : false);
            Error_report(ERROR_CODE_APPS2_LOW, &pedal_err_count.apps2.low, apps2 < 0.0 ? true : false);
            Error_report(ERROR_CODE_APPS_DIVERGE, &pedal_err_count.apps_disagree, apps1-apps2 > 0.1 || apps2-apps1 > 0.1 ? true : false);
            Error_report(ERROR_CODE_BSE_LOW, &pedal_err_count.bse.low, fuzzy_edge_remover(oil_filtered, 70.0, 0.0, 15) < 0.0 ? true : false);
            Error_report(ERROR_CODE_BSE_HIGH, &pedal_err_count.bse.high, fuzzy_edge_remover(oil_filtered, 70.0, 0.0, 5)  > 70.0 ? true : false);
            
            /*output the final values to global resources ----------------------------------------------------*/
            xSemaphoreTake(pedal.mutex, pdMS_TO_TICKS(MUTEX_TIMEOUT));
                pedal.apps1 = apps1;
                pedal.apps2 = apps2;
                pedal.bse = bse;
            xSemaphoreGive(pedal.mutex);
        
        
            /*update the values for the rest of the sensors -------------------------------------------------*/
            xSemaphoreTake(travel_strain_oil_sensor.mutex, pdMS_TO_TICKS(MUTEX_TIMEOUT));
                travel_strain_oil_sensor.left = travel_transfer_function(adc_dma_buffer.travel_l);
                travel_strain_oil_sensor.right = travel_transfer_function(adc_dma_buffer.travel_r);
                travel_strain_oil_sensor.strain = adc_dma_buffer.strain;
                travel_strain_oil_sensor.oil_pressure = fuzzy_edge_remover(oil_filtered, 70.0, 0.0, 15);
            xSemaphoreGive(travel_strain_oil_sensor.mutex);
        
        }
        if(pending_notifications & FLAG_HALL_EDGE_LEFT) {
            xSemaphoreTake(hall_time_L.mutex, MUTEX_TIMEOUT);
                pending_notifications &= ~FLAG_HALL_EDGE_LEFT; //clear flags

                timer_time_t diff = {0};
                update_time_stamp(&hall_time_L_last, &hall_time_L, &diff); 

                xSemaphoreTake(wheel_speed_sensor.mutex, MUTEX_TIMEOUT); 
                    wheel_speed_sensor.left = wheel_speed_tranfser_function(diff.elapsed_count, diff.timer_count);
                xSemaphoreGive(wheel_speed_sensor.mutex);
            xSemaphoreGive(hall_time_L.mutex);
        }
        if(pending_notifications & FLAG_HALL_EDGE_RIGHT) {
            xSemaphoreTake(hall_time_R.mutex, MUTEX_TIMEOUT);
                pending_notifications &= ~FLAG_HALL_EDGE_RIGHT; //clear flags

                timer_time_t diff = {0};
                update_time_stamp(&hall_time_R_last, &hall_time_R, &diff);

                xSemaphoreTake(wheel_speed_sensor.mutex, MUTEX_TIMEOUT);
                    wheel_speed_sensor.right = wheel_speed_tranfser_function(diff.elapsed_count, diff.timer_count);
                xSemaphoreGive(wheel_speed_sensor.mutex);
            xSemaphoreGive(hall_time_R.mutex);
        }
        if(pending_notifications & FLAG_READ_TIRE_TEMP) {
            pending_notifications &= ~FLAG_READ_TIRE_TEMP;
#ifdef USE_D6T
            /*read the values from both sensors ---------------------------------------------------*/
            if(!d6t_right_err) {
                HAL_I2C_Mem_Read_DMA(
                    &hi2c5,
                    d6t_dma_buffer_R.addr_write, 
                    d6t_dma_buffer_R.command, 
                    1, 
                    &(d6t_dma_buffer_R.PTAT.low), 
                    sizeof(d6t_dma_buffer_R.PTAT)+sizeof(d6t_dma_buffer_R.temp)+sizeof(d6t_dma_buffer_R.PEC));
            }
            if(!d6t_left_err) {
                HAL_I2C_Mem_Read_DMA(
                    &hi2c1, 
                    d6t_dma_buffer_L.addr_write, 
                    d6t_dma_buffer_L.command, 
                    1, 
                    &(d6t_dma_buffer_L.PTAT.low), 
                    sizeof(d6t_dma_buffer_L.PTAT)+sizeof(d6t_dma_buffer_L.temp)+sizeof(d6t_dma_buffer_L.PEC));
            }
            // wait for the DMA to finish, while we can do other stuff in the mean time
            //TODO: setup timeout exception and deal with error case where the stuff did not finish
#endif
        }
        if(pending_notifications & FLAG_I2C1_FINISH) {
            pending_notifications &= ~FLAG_I2C1_FINISH; //clear flags

            //TODO: CRC the data

            xSemaphoreTake(tire_temp_sensor.mutex, pdMS_TO_TICKS(MUTEX_TIMEOUT));
                for(int i=0; i<sizeof(d6t_dma_buffer_L.temp)/sizeof(d6t_dma_buffer_L.temp[0]); i++) {
                    tire_temp_sensor.left[i] = tire_temp_transfer_function(d6t_dma_buffer_L.temp[i].high, d6t_dma_buffer_L.temp[i].low);
                }
            xSemaphoreGive(tire_temp_sensor.mutex);
        }
        if(pending_notifications & FLAG_I2C5_FINISH) {
            pending_notifications &= ~FLAG_I2C5_FINISH; //clear flags

            //TODO: CRC the data

            xSemaphoreTake(tire_temp_sensor.mutex, pdMS_TO_TICKS(MUTEX_TIMEOUT));
                for(int i=0; i<sizeof(d6t_dma_buffer_R.temp)/sizeof(d6t_dma_buffer_R.temp[0]); i++) {
                    tire_temp_sensor.right[i] = tire_temp_transfer_function(d6t_dma_buffer_R.temp[i].high, d6t_dma_buffer_R.temp[i].low);
                }
            xSemaphoreGive(tire_temp_sensor.mutex);   
        }
        if(pending_notifications & FLAG_READ_STEER) {
            pending_notifications &= ~FLAG_READ_STEER; //clear flags

            //see https://www.cuidevices.com/product/resource/amt22.pdf
            //TODO: using hardware NSS right now because SCK jitters when NSS is switched by software for some reason
            //but hardware NSS does not observe 3us after all bytes transmission
            spi_tx_buffer[0] = 0;
            spi_tx_buffer[1] = 0;

            /*start the SPI transmission in IT mode and wait for it to finish --------------------------------------------*/
            if(HAL_SPI_TransmitReceive_IT(&hspi4, spi_tx_buffer, spi_rx_buffer, 2) != HAL_OK) {
                steer_angle_period = STEER_PERIOD_ERR;
                break;
            }
            if(wait_for_notif_flags(FLAG_SPI4_FINISH, pdMS_TO_TICKS(SPI_TIMEOUT), &pending_notifications) != pdTRUE) {
                steer_angle_period = STEER_PERIOD_ERR;
                break;
            }
            else {
                steer_angle_period = STEER_PERIOD_NORMAL;
            }

            /*calculate position and put the stuff into variables ----------------------------------------------------*/
            const uint8_t highByte = spi_rx_buffer[0];
            const uint8_t lowByte = spi_rx_buffer[1];
            const uint16_t position = ((uint16_t)highByte << 8) + (uint16_t)lowByte;

            uint32_t prevErr = 0;
            ErrorHandler_get_error(&error_handler, &prevErr);

            //calculate the parity of odd and even bits
            if(AMT22_parity_check(position) == 0) {
                xSemaphoreTake(steer_angle_sensor.mutex, MUTEX_TIMEOUT);
                    steer_angle_sensor.steering_angle = steer_angle_transfer_function((position & 0x3FFF) >> 2);
                xSemaphoreGive(steer_angle_sensor.mutex);
                
                if(prevErr & ERROR_CODE_AMT22) {
                    ErrorHandler_write_error(&error_handler, ERROR_CODE_AMT22, ERROR_CLEAR);
                    steer_angle_period = STEER_PERIOD_NORMAL;
                }
            }
            else {
                if(!(prevErr & ERROR_CODE_AMT22)) {
                    ErrorHandler_write_error(&error_handler, ERROR_CODE_AMT22, ERROR_SET);
                    steer_angle_period = STEER_PERIOD_ERR;
                }
            }
        }
    }
}

/**
 * @brief wrapper function to wait for specific bits in the task notification
 * @param target the target that needs to be waited 
 * @param timeout the timeout in ticks
 * @param gotten all the flags that are set. target bits would be autocleared if they are gotten
 * @return the status of the function
 */
BaseType_t wait_for_notif_flags(uint32_t target, uint32_t timeout, uint32_t* const gotten) {    
    uint32_t flag_buf = 0U;
    uint32_t flag_gotten = *gotten;
    const TickType_t t0 = xTaskGetTickCount();
    TickType_t tlast = t0;
    
    //if either of which is not set
    while(~flag_gotten & target) {
        BaseType_t Wait_result = xTaskNotifyWait(0, 0xFFFFFFFFUL, &flag_buf, timeout-(tlast-t0));
        if(Wait_result == pdFALSE) {
            return pdFALSE; 
        }

        flag_gotten |= flag_buf;
        *gotten = flag_gotten;
        tlast = xTaskGetTickCount();
    } 

